УправлениеПаркомАттракционов/src/DataProcessors/РабочееМестоКассира/РабочееМестоКассира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКассира</name>
</mdclass:DataProcessor>

УправлениеПаркомАттракционов/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеПаркомАттракционов/src/Documents/ПродажаБилета/ПродажаБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаБилета</name>
  <registerRecords>AccumulationRegister.ПосещенияАттракционов</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиБилетов</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллыКСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Билеты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/DataProcessors/РабочееМестоКассира/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыКСписаниюПриИзменении(Элемент)
	
	РассчитатьСуммуИтого();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаИтогоПриИзменении(Элемент)
	
	РассчитатьБаллыКСписанию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	ДобавитьСтрокуВБилеты(ДанныеСтроки);	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = Новый Структура("Номенклатура, Цена", ДанныеСтроки.Номенклатура, ДанныеСтроки.Цена); 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБилеты

&НаКлиенте
Процедура БилетыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ДанныеСтроки = ПараметрыПеретаскивания.Значение;
	
	Если Не ТипЗнч(ДанныеСтроки) = Тип("Структура") 
			или ДанныеСтроки.Свойство("Номенклатура") = Неопределено
	Тогда
		Возврат;		
	КонецЕсли;	
	
	ДобавитьСтрокуВБилеты(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Билеты.ТекущиеДанные;
	
	ТекущиеДанные.Цена = ЦенаНоменклатуры(ТекущиеДанные.Номенклатура);
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыЦенаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Билеты.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыКоличествоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Билеты.ТекущиеДанные;

	РассчитатьСуммуСтроки(ДанныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыполнитьПродажу(Команда)
	
	ТекстВопроса = "Выполнить создание документа ""Продажа билета""?";
	
	Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Ответ = Ждать Обещание;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументСсылка = СоздатьДокументПродажаБилета();
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда	
		ОповеститьОбИзменении(ДокументСсылка);
		
		ПоказатьОповещениеПользователя("Создан документ",
				ПолучитьНавигационнуюСсылку(ДокументСсылка),
				Строка(ДокументСсылка));			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьСтрокуВБилеты(ДанныеСтроки)
	
	ПараметрыОтбора = Новый Структура("Номенклатура", ДанныеСтроки.Номенклатура);
	НайденныеСтроки = Билеты.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() Тогда
		Возврат;		
	КонецЕсли;	
	
	НоваяСтрока = Билеты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки, "Номенклатура, Цена");
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = НоваяСтрока.Цена;
	
	РассчитатьСуммуИтого();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Знач Номенклатура)
	
	ЦенаНоменклатуры = РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура, ТекущаяДатаСеанса());
	
	Возврат ЦенаНоменклатуры;
	
КонецФункции	

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ДанныеСтроки)

	ДанныеСтроки.Сумма = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
	
	РассчитатьСуммуИтого();
	
КонецПроцедуры	

&НаКлиенте
Процедура РассчитатьСуммуИтого()
	
	СуммаИтого = Билеты.Итог("Сумма") - БаллыКСписанию;
	
КонецПроцедуры

&НаКлиенте 
Процедура РассчитатьБаллыКСписанию()
	
	БаллыКСписанию = Билеты.Итог("Сумма") - СуммаИтого;
	
КонецПроцедуры	

&НаСервере
Функция СоздатьДокументПродажаБилета()
	
	ДокументСсылка = Документы.ПродажаБилета.ПустаяСсылка();

	ДокументОбъект = Документы.ПродажаБилета.СоздатьДокумент();
	ДокументОбъект.Заполнить(Неопределено);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Клиент = Клиент;
	ДокументОбъект.Билеты.Загрузить(Билеты.Выгрузить());
	ДокументОбъект.БаллыКСписанию = БаллыКСписанию;
	ДокументОбъект.СуммаДокумента = СуммаИтого;
	
	Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
		ТекстСообщения = "Не удалось записать документ";
		
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;	
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументСсылка = ДокументОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон("Не удалось провести документ по причине: %1%2", Символы.ПС, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;			
	
	Возврат ДокументСсылка;
	
КонецФункции	

#КонецОбласти
